tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "stripe/stripe-cli"
tap "supabase/tap"
brew "bash-completion"
brew "bat"
brew "bfg"
brew "deno"
brew "docker"
brew "ffmpeg"
brew "gh"
brew "gifski"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "mas"
brew "miniupnpc"
brew "neofetch"
brew "nvm"
brew "ollama"
brew "openai-whisper"
brew "pipx"
brew "sphinx-doc"
brew "watchman"
brew "yt-dlp"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
cask "ankermake"
cask "arc"
cask "audacity"
cask "beamer"
cask "discord"
cask "figma"
cask "font-fira-code"
cask "github"
cask "google-chrome"
cask "graphiql"
cask "graphql-playground"
cask "kap"
cask "keycastr"
cask "lm-studio"
cask "notion"
cask "notion-calendar"
cask "raycast"
cask "signal"
cask "spotify"
cask "stremio"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"
# font 
cask "font-fira-code"
# mac app store apps 
mas "Amphetamine", id: 937984704
mas "Backtrack", id: 1477089520
mas "com.BZG.Aerate", id: 1480882940
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Intermission", id: 1439431081
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Wifilicious", id: 6563147813
mas "Xcode", id: 497799835
# vscode bits 
vscode "aaron-bond.better-comments"
vscode "adityavm.vscode-monokai-seti"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "be5invis.vscode-custom-css"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "denoland.vscode-deno"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-preview"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "gurayyarar.expressjs-4-snippets"
vscode "johnpapa.vscode-peacock"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.openai-chatgpt-adhoc"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "prisma.prisma"
vscode "qinjia.seti-icons"
vscode "rangav.vscode-thunder-client"
vscode "rapidapi.vscode-rapidapi-client"
vscode "rapidapi.vscode-services"
vscode "reactreedev.reactree"
vscode "robbowen.synthwave-vscode"
vscode "stripe.vscode-stripe"
vscode "supabase-snippets.supabase-javascript-snippets"
vscode "supabase.vscode-supabase-extension"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "zernonia.supabase-vscode"