tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
# github command-line tool
brew "gh"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Modern replacement for 'ls'
brew "exa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Mac App Store command-line interface
brew "mas"
# UPnP IGD client library and daemon
brew "miniupnpc"
# Fast, highly customisable system info script
brew "neofetch"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Watch files and take action when they change
brew "watchman"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Google Chrome browser
cask "google-chrome"
# Desktop casting/streaming app for Apple TV and Chromecast
cask "beamer"
# Tool to hide status bar icons
cask "dozer"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
cask "graphql-playground"
# Open-source screen recorder built with web technology
cask "kap"
# Instant messaging application focusing on security
cask "signal"
# Video communication and virtual meeting platform
cask "zoom"
# Control your tools with a few keystrokes
cask "raycast"
# Reimagine your terminal
cask "fig"
# figma 
cask "figma"
# HTTP and GraphQL Client
cask "insomnia"
# KeyCastr to share your keystrokes when creating screencasts
cask "keycastr"
# Hyper terminal
cask "hyper"
# Notion
cask "notion"
# command palatte
cask "raycast"
cask "spotify"
# for the new mac with notch show a black bar
cask "topnotch"
# vscode 
cask "visual-studio-code"
# whatsapp 
cask "whatsapp"
# font 
cask "font-fira-code"
# mac app store apps 
mas "Amphetamine", id: 937984704
mas "Backtrack", id: 1477089520
mas "com.BZG.Aerate", id: 1480882940
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Magnet", id: 441258766
mas "Intermission", id: 1439431081
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LastPass", id: 926036361
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "TweetDeck", id: 485812721
mas "Unarchiver One", id: 1127253508
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
