tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "stripe/stripe-cli"
tap "supabase/tap"
brew "bash-completion"
brew "bat"
brew "bfg"
brew "deno"
brew "docker"
brew "ffmpeg"
brew "gh"
brew "gifski"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "mas"
brew "miniupnpc"
brew "neofetch"
brew "nvm"
brew "ollama"
brew "openai-whisper"
brew "pipx"
brew "sphinx-doc"
brew "watchman"
brew "yt-dlp"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
cask "ankermake"
cask "arc"
cask "audacity"
cask "beamer"
cask "discord"
cask "figma"
cask "font-fira-code"
cask "github"
cask "google-chrome"
cask "graphiql"
cask "graphql-playground"
cask "kap"
cask "keycastr"
cask "lm-studio"
cask "notion"
cask "notion-calendar"
cask "raycast"
cask "signal"
cask "spotify"
cask "stremio"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zoom"
# font 
cask "font-fira-code"
# mac app store apps 
mas "Amphetamine", id: 937984704
mas "Backtrack", id: 1477089520
mas "com.BZG.Aerate", id: 1480882940
mas "DaVinci Resolve", id: 571213070
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Intermission", id: 1439431081
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Wifilicious", id: 6563147813
mas "Xcode", id: 497799835
